Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/building.po
Languages: uk

source: Developer's Manual
uk: Керівництво розробника

source: helping bauble development
uk: допомагаючи розвитку bauble

source: Installing Bauble always includes downloading the sources, connected to the github repository. This is so because in our eyes, every user is always potentially also a developer.
uk: Установка Bauble завжди включає в себе завантаження джерел, підключених до сховища GitHub. Це так, тому що в наших очах, кожен користувач завжди потенційно також є розробником.

source: If you want to contribute to Bauble, you can do so in quite a few different ways::
uk: Якщо ви хочете внести свій внесок в Bauble, ви можете зробити це в багато різних способів::

source: bug solving workflow
uk: робочий процес над помилками

source: normal development workflow
uk: нормальний робочий процес розробки

source: while using the software, you notice a problem, or you get an idea of something that could be better, you think about it good enough in order to have a very clear idea of what it really is, that you noticed. you open an issue and describe the problem. someone might react with hints.
uk: під час користування програмним забезпеченням, ви помічаєте проблеми, або ви отримаєте уявлення про те, що може бути краще, ви думаєте про це, достатньо для того, щоб мати дуже чітке уявлення про це. Ви відкриваєте випуск і описуєте проблему. Хтось може реагувати на це.

source: you open the issues site and choose one you want to tackle.
uk: ви відкриваєте сайт випусків і вибираєте один який ви хочете вирішувати.

source: assign the issue to yourself, this way you are informing the world that you have the intention to work at it. someone might react with hints.
uk: призначити цей випуск для себе, таким чином, ви інформуєте спільноту, що у вас є намір працювати над ним.

source: optionally fork the repository in your account and preferably create a branch, clearly associated to the issue.
uk: за потреби, розгалуження сховища у вашому обліковому записі бажано створити гілку, безспірно пов'язану до випуску.

source: write unit tests and commit them to your branch (do not commit failing unit tests to the ``master`` branch).
uk: написати блок тестів і зафіксувати їх в вашій гілці (не фіксуйте невдалий блок тестів в гілку `` master``).

source: write more unit tests (ideally, the tests form the complete description of the feature you are adding or correcting).
uk: написати додатковий блок тестів (в ідеалі, тести утворюють повний опис функції, ви це додаєте або коректуєте).

source: make sure the feature you are adding or correcting is really completely described by the unit tests you wrote.
uk: переконайтеся, що функція, яку ви додаєте або коректуєте дійсно повністю описує блок тестів, які ви написали.

source: write the code that makes your tests succeed.
uk: написати код, який робить тести успішними.

source: update the i18n files (run ``./scripts/i18n.sh``).
uk: оновити файли i18n (запустити ``./scripts/i18n.sh``).

source: whenever possible, translate the new strings you put in code or glade files.
uk: всякий раз, коли це можливо, переведіть нові рядки які ви вставляєте в код або glade файли.

source: commit your changes.
uk: зафіксувати зміни.

source: push to github.
uk: передати github.

source: open a pull request.
uk: відкрити пул запиту.

source: publishing to production
uk: публікація продукту

source: open the pull request page using as base the production line, compared to ``master``.
uk: відкрити сторінку пулу запиту з використанням в якості основи виробничу лінію, прирівняну до ``master``.

source: make sure a ``bump`` commit is included in the differences.
uk: переконайтеся що ``bump`` фіксація включена в розбіжностях.

source: it should be possible to automatically merge the branches.
uk: повинна бути забезпечена можливість автоматичного злиття гілок.

source: create the new pull request, call it as “publish to the production line”.
uk: створити новий пул запиту, викличте його як “publish to the production line”.

source: you possibly need wait for travis-ci to perform the checks.
uk: вам, можливо, буде потрібно почекати travis-ci для виконання перевірки.

source: merge the changes.
uk: об'єднати зміни.

source: tell the world about it: on facebook, the google group, linkedin, ...
uk: розповісти світові про це: на Facebook, групі Google, linkedin, ...

source: closing step
uk: крок закриття

source: review this workflow. consider this as a guideline, to yourself and to your colleagues. please help make it better and matching the practice.
uk: розглянути цей робочий процес. розглядати це в якості орієнтира, до себе і до своїх колег. будь ласка, допоможіть зробити його краще і відповідно практичним.

source: structure of user interface
uk: структура інтерфейсу користувача

source: the user interface is built according to the Model-View-Presenter architectural pattern. The **view** is described in a glade file and is totally dumb, you do not subclass it because it implements no behaviour and because its appearance is, as said, described elsewhere, including the association signal-callbacks. The **model** simply follows the sqlalchemy practices.
uk: Інтерфейс користувача побудований відповідно з архітектурним зразком Model-View-Presenter. **view** описується в glade файлі і повністю в dumb, ви не зробити підкласи з цього тому що він не реалізує поводження і тому, що його зовнішній вигляд, як було сказано, описано в іншому місці, в тому числі асоціації сигналів зворотних викликів. **model** просто слідує SQLAlchemy методу.

source: You will subclass the **presenter** in order to:
uk: Ваші підкласи **presenter** для того, щоб:

source: define ``widget_to_field_map``, the association from name of view object to name of model attribute,
uk: визначити ``widget_to_field_map``, асоціація з ім'ям виду об'єкта для імені атрибута моделі,

source: override ``view_accept_buttons``, the list of widget names which, if activated by the user, mean that the view should be closed,
uk: анулювати ``view_accept_buttons``, список віджет імен які активовані користувачем, означає, що представлення повинно бути закрите,

source: define all needed callbacks,
uk: визначити всі необхідні функції зворотного виклику,

source: The presenter should not know of the internal structure of the view, instead, it should use the view api to set and query the values inserted by the user. The base class for the presenter, ``GenericEditorPresenter`` defined in ``bauble.editor``, implements many generic callbacks.
uk: Презентатор не повинен знати про внутрішню структуру представлення, замість цього, він повинен використовувати представлення api для установки і запиту значень, вставлених користувачем. Базовий клас для презентатора, ``GenericEditorPresenter`` визначений в ``bauble.editor``, реалізує багато загальних функцій зворотного виклику.

source: The ``Tag`` plugin is a good minimal example, even if the ``TagItemGUI`` falls outside this description. Other plugins do not respect the description.
uk: ``Tag`` плагін хороший мінімальний приклад, навіть якщо ``TagItemGUI`` виходить за межі цього опису. Інші плагіни не відносяться до опису.

source: We use the same architectural pattern for non-database interaction, by setting the presenter also as model. We do this, for example, for the JSON export dialog box.
uk: Ми використовуємо той же архітектурний зразок для взаємодії без бази даних, встановивши презентатор також в якості моделі. Ми робимо це, наприклад, для вікна діалогу експорту JSON.

source: building (on Windows)
uk: будування (в Windows)

source: Building a python program is a bit of a contraddiction. You don't normally *build* nor *compile* a python program, you run it in its (virtual) environment, and python will process the modules loaded and produce faster-loading *compiled* python files. You can, however, produce a *Windows executable* from a python script, executable containing the whole python environment and dependencies.
uk: Побудова програм python є трохи contraddiction. Ви зазвичай не *build* ні *compile* програму python, ви запустите його в (віртуальному) середовищі, і python буде обробляти завантажені модулі і виробляє більш швидку загрузку *compiled* python файлів. Можна, однак, зробити *Windows executable* з python скрипт, виконуваний файл, який містить все python середовище і залежності.

source: Follow all steps needed to set up a working Bauble environment from :doc:`installing`, but skip the final ``install`` step.
uk: Виконайте всі кроки, необхідні для налаштування середовища робочої Bauble з :doc:`installing`, але пропустіть фінальний крок ``install``.

source: instead of *installing* Bauble, you produce a Windows executable. This is achieved with the ``py2exe`` target, which is only available on Windows systems::
uk: Замість *installing* Bauble, ви створюєте виконуваний файл Windows. Це досягається за допомогою ``py2exe``, що доступно тільки в системах Windows::

source: At this point you can run Bauble. To run the compiled executable run::
uk: На цьому етапі ви можете запустити Bauble. Для запуску скомпільованого виконуваного файлу запустити::

source: or copy the executable to wherever you think appropriate.
uk: або скопіювати виконуваний файл туди, куди ви вважаєте доречними.

source: To optionally build an NSIS installer package you must install NSIS from `nsis.sourceforge.net <http://nsis.sourceforge.net/Download>`_. After installing NSIS right click on ``.\scripts\build.nsi`` in Explorer and select *Compile NSIS Script*.
uk: Щоб додатково створити інсталяційний пакет NSIS, ви повинні встановити NSIS з `nsis.sourceforge.net <http://nsis.sourceforge.net/Download>`_. Після установки NSIS правою кнопкою миші натисніть ``.\scripts\build.nsi`` в Провіднику і виберіть *Compile NSIS Script*.
