Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/imex.po
Languages: uk

source: Importing and Exporting Data
uk: Імпорт та експорт даних

source: Although Bauble can be extended through plugins to support alternate import and export formats, by default it can only import and export comma seperated values files or CSV.
uk: Хоча Bauble може бути розширена за рахунок плагінів для підтримки альтернативних форматів імпорту та експорту, за замовчуванням він може тільки імпорт і експорт розділених комою значень файлів або CSV.

source: There is some support for exporting to the Access for Biological Collections Data it is limited.
uk: Існує деяка підтримка експорту в Access для біологічних колекцій даних але вона обмежена.

source: There is also limited support for exporting to an XML format that more or less reflects exactly the tables and row of the database.
uk: Існує також обмежена підтримка експорту в форматі XML, який більш-менш точно відображає таблиці та рядки бази даних.

source: Importing files will most likely destroy any data you have in the database so make sure you have backed up your data.
uk: Імпорт файлів, швидше за все, знищити будь-які дані, які ви маєте на базі даних, переконатися, що ви створили резервну копію даних.

source: Importing from CSV
uk: Імпорт з CSV

source: To import CSV files into Bauble select :menuselection:`Tools-->Export-->Comma Seperated Values` from the menu.
uk: Щоб імпортувати CSV файли в Bauble виберіть: menuselection :menuselection:`Tools-->Export-->Comma Seperated Values` з меню.

source: After clicking OK on the dialog that ask if you are sure you know what you're doing a file chooser will open. In the file chooser select the files you want to import.
uk: Після натискання OK в діалоговому вікні запиту, якщо ви впевнені, що знаєте, що робите, вибрані файли будуть відкриті. У файловому браузері виберіть файли, які ви хочете імпортувати.

source: Exporting to CSV
uk: Експорт в CSV

source: To export the Bauble data to CSV select :menuselection:`Tools-->Export-->Comma Seperated Values` from the menu.
uk: Щоб експортувати дані Bauble в CSV виберіть :menuselection:`Tools-->Export-->Comma Seperated Values` з меню.

source: Importing from JSON
uk: Імпорт з JSON

source: Using the Bauble json interchange format, you can import data which you have exported from a different Bauble installation.
uk: За допомогою Bauble json формату обміну, ви можете імпортувати дані, які ви експортували з іншої Bauble установки.

source: Exporting to JSON
uk: Експорт у JSON

source: This feature is still under development.
uk: Ця функція знаходиться в стадії розробки.
