Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/installing.po
Languages: es, it, uk

source: Installation
es: Instalación
it: Installazione
uk: Встановлення

source: bauble.classic is a cross-platform program and it will run on unix machines like Linux and MacOSX, as well as on Windows.
es: bauble.classic es un programa independiente de la plataforma software pues puede funcionar en sistemas unix como Linux y MacOSX así como en Windows.
it: bauble.classic è un programma multipiattaforma e funziona su macchine unix (Linux e MacOSX) ma anche su Windows.
uk: bauble.classic крос-платформна програма і вона буде працювати на Unix машинах, таких як Linux і MacOSX, а також на Windows.

source: To install Bauble first requires that you install its dependencies that cannot be installed automatically. These include virtualenvwrapper, PyGTK and pip. Python and GTK+, you probably already have. As long as you have these packages installed then Bauble should be able to install the rest of its dependencies by itself.
es: Para instalar Bauble primero hay que instalar dependencias que no pueden ser solucionadas automáticamente. Estas incluyen virtualenv, pygtk, y pip. Python y GTK+, muy probablemente ya se encuentra en la computadora. El programa de instalación puede hacerlo todo, después de haberle puesto a disposición los programas que él necesita.
it: Per installare Bauble, c'è bisogno di soddifare un paio di dipendenze che non possono essere risolte automaticamente. Queste includono virtualenvwrapper, PyGTK e pip. Python è presente su ogni macchina unix, mentre GTK+ è nativo di Linux ed altrimenti va installato. Dopo aver soddisfatte queste richieste, è possibile lasciare a Bauble il compito di risolvere tutte le altre.
uk: Для установки Bauble спочатку потрібно установити його пакети, які не можуть бути встановлені автоматично. До них відносяться virtualenvwrapper, PyGTK і pip. Python і GTK +, ви, ймовірно, вже маєте. Як тільки у вас є ці пакети встановлені, то Bauble буде в змозі встановити решту пакетів самостійно.

source: If you follow these installation steps, you will end with Bauble running within a Python virtual environment, all Python dependencies installed locally, non conflicting with any other Python program you may have on your system.
es: Si sigue los siguientes pasos, se encontrará con Bauble instalado en un entorno virtual, todas la dependencias Python estarán instalada localmente y no entrarán en conflicto con otros programas Python que puedan estar el la misma computadora.
it: Seguendo le seguenti istruzioni di installazione si ottiene un Bauble installato in un ambiente Python virtuale, tutte le dipendenze saranno installate localmente e non entreranno in conflitto con altri programmi Python che possono essere sullo stesso elaborator.
uk: Якщо ви будете слідувати цим крокам установки, ви будете працювати з Bauble у віртуальному середовищі Python, всі залежності Python, встановлені локально, не суперечать один одному з будь-якою іншою програмою Python що ви можете мати у вашій системі.

source: if you later choose to remove Bauble, you simply remove the virtual environment, which is a directory, with all of its content.
es: Si por cualquier razón quisiera usted borrar Bauble, lo único que tiene que hacer es borrar el entorno virtual, que es una carpeta, con todo su contenido.
it: se dovessi in seguito decidere di rimuovere Bauble, basterà rimuovere l'ambiente virtuale, che è una directory, con tutto il suo contenuto.
uk: якщо пізніше ви вирішите видалити Bauble, ви просто видалите віртуальне середовище, яке є каталогом, з усім його вмістом.

source: Installing on Linux
es: Instalación en Linux
it: Istallare su Linux
uk: Установка на Linux

source: Download the `devinstall.sh` script and run it::
es: Bajar el archivo `devinstall.sh` y ejecutarlo::
it: Scaricare il programmino `devinstall.sh` ed eseguirlo::
uk: Завантажити `devinstall.sh` скрипт і запустити його::

source: Please not that the script will not help you install any extra database connector. This you will do in a later step.
es: Nótese por favor que el archivo de instalación no bajará ningún conector de base de datos. Si quiere utilizar otra base de datos que la por defecto (SQLite), tendrá que instalar algún conector extra.
it: Nota bene: il programmino di cui sopra non installerà alcun connettore a base dati. Questo è lasciato per un passo successivo.
uk: Будь ласка, це не той скрипт що допоможе вам встановити додатковий роз'єм бази даних. Це ви будете робити на більш пізньому етапі.

source: You can study the script to see what steps if runs for you. In short it will install dependencies which can't be satisfied in a virtual environment, then it will create a virtual environment named `bacl`, download the sources and connect your git checkout to the `bauble-1.0` branch (this you can consider a production line), it then builds bauble, downloading all remaining dependencies, and finally it creates a startup script in your `~/bin` folder.
es: Si tiene interés, puede examinar el archivo para ver qué es lo que hace. Muy sintético: primero examina eventuales problemas que no se pueden solucionar en un entorno virtual, luego crea el entorno con nombre `bacl`, baja todo el código fuente y conecta la copia local con la linea de producción `bauble-1.0` en github, luego instala bauble, solucionando todas dependencias Python, y finalmente crea un archivo de arranque en la carpeta `~/bin`.
it: Puoi esaminare il programmino e seguire quali passi esegue. In breve: installa le dipendenze che non possono essere soddisfatte in un ambiente virtuale, crea poi l'ambiente virtuale, di nome `bacl` (che sta per ba(uble.)cl(assic)), scarica i sorgenti e connette il checkout git alla linea di produzione `bauble-1.0`, dopo di che procede con la sua installazione, che implica lo scaricare tutte le dipendenze. Questo può prender tempo. Infine crea un programmino di avvio di nome `bauble`, nella directory `~/bin` dell'utente corrente.
uk: Ви можете вивчити сценарій щоб побачити, які кроки виконуються для вас. Коротше кажучи буде встановлювати залежності, які не можуть бути задоволені в віртуальному середовищі, що створить віртуальне середовище з ім'ям `bacl`, загрузити джерела і підключити git перевірку для `bauble-1.0` відділення (це можна розглядати як виробничу лінію), яка будує bauble, завантаження всіх інших залежностей, і, нарешті, він створює скрипт запуску в `~ / bin` папці.

source: If the script ends without error, you can now start bauble::
es: Si el proceso terminó sin errores, ya puede arrancar bauble::
it: Se il programmino di installazione termina senza errori, si può ora avviare bauble::
uk: Якщо сценарій завершується без помилок, ви можете запустити bauble::

source: or update bauble to the latest released production patch::
es: si quiere poner al día con la última versión publicada::
it: o aggiornare bauble all'ultima versione rilasciata nella linea di produzione::
uk: або оновити bauble до останнього випущеного виробничого патча::

source: The same script you can use to switch to a different production line, but at the moment there's only `bauble-1.0`.
es: El mismo archivo `devinstall.sh` puede ser utilizado para pasar a otra linea de producción. Sin embargo al momento solo hay `bauble-1.0`.
it: Lo stesso programmino puoi utilizzarlo per cambiare ad un'altra linea di produzione, anche se al momento c'è solo la `bauble-1.0`.
uk: Той же сценарій ви можете використовувати для перемикання на іншу виробничу лінію, але на даний момент є тільки `bauble-1.0`.

source: on Unity, open a terminal, start bauble, its icon will show up in the launcher, you can now `lock to launcher` it.
es: Utilizando Unity, abra un terminal, arranque bauble, su icono aparecerá en el "launcher", y puede ahora pegarlo para que quede a disposición.
it: su Uniti, apri un terminale, avvia bauble, la sua icona (un diamante verde) apparirà nel `launcher`, e se si vuole lo si può saldare al launcher.
uk: на Unity, відкрийте термінал, запустіть bauble, його значок буде відображатися в панелі запуску, тепер ви можете це `lock to launcher`.

source: If you would like to use the default `SQLite <http://sqlite.org/>`_ database or you don't know what this means then you can skip this step. If you would like to use a database backend other than the default SQLite backend then you will also need to install a database connector.
es: Si quiere utilizar el conector por defecto de la base de datos `SQLite <http://sqlite.org/>`_, o si ni idea tiene de que quiere decir eso, puede ignorar este paso. Pero si ha decidido conectarse a otra base de datos, será necesario instalar el conector correspondiente.
uk: Якщо ви хочете використовувати за замовчуванням `SQLite <http://sqlite.org/>`_базу даних або ви не знаєте, що це значить, то ви можете пропустити цей крок. Якщо ви хочете використовувати базу даних бекенд, крім SQLite бекенда за замовчуванням, то вам також необхідно встановити з'єднувач бази даних.

source: If you would like to use a `PostgreSQL <http://www.postgresql.org>`_ database then activate the virtual environment and install psycopg2 with the following commands::
es: Para utilizar `PostgreSQL <http://www.postgresql.org>`_, activar el entorno virtual e instalar `psycopg2` con las instrucciones siguientes.
it: Se si desidera utilizzare un database `PostgreSQL <http://www.postgresql.org>`_, si attivi l'ambiente virtuale e si installi psycopg2 con i seguenti comandi::
uk: Якщо ви хотіли б використовувати `PostgreSQL <http://www.postgresql.org>`_базу даних тоді активуйте віртуальне середовище і встановіть psycopg2 з наступними командами::

source: You might need solve dependencies. How to do so, depends on which Linux flavour you are using. Check with your distribution documentation.
es: Podría ser necesario resolver dependencias. Cómo hacerlo, depende de cual distribución Linux utiliza, y en que versión. Averigüe la documentación.
it: Potrebbe essere necessario risolvere delle dipendenze. Come farlo, dipende dalla distribuzione Linux che si sta utilizzando. Consultare la documentazione corrispondente.
uk: Вам, можливо, буде потрібно визначити залежності. Як зробити так, залежить від того, який Linux ви використовуєте. Зверніться до документації розподілу.

source: Next...
es: Siguiente...
uk: Далі...

source: Installing on MacOSX
es: Instalar en MacOSX
it: Istallare su MacOSX
uk: Установка на MacOSX

source: Being MacOSX a unix environment, most things will work the same as on Linux (sort of).
es: Siendo MacOSX una versión de unix, todo funciona como en Linux, pues más o menos.
it: Considerando che MacOSX è unix, la maggior parte dei passi sono uguali al caso Linux, diciamo così.
uk: MacOSX являється середовищем unix, більшість речей буде працювати так само, як і на Linux (різновид).

source: One difficulty is that there are many more versions of MacOSX out there than one would want to support, and only the current and its immediately preceding release are kept up-to-date by Apple-the-firm.
es: Una dificultad presente con MacOSX es que hay muchas versiones del sistema operativo, y que la puesta al día no es automática ni gratuita, así que varios sistemas siguen funcionando con versiones obsoletas.
it: Una difficoltà importante su MacOSX è che ci sono davvero moltissime versioni diverse di questo sistema operativo e non ci è possibile sostenerle tutte, inoltre Apple "l'impresa" tiene aggiornate solo le ultime due versioni, così che su quelle precedente potrebbe essere difficile o impossibile istallare software recente.
uk: Трудність полягає в тому, що існує не одна а безліч версій MacOSX, що б всіх їх підтримати, і тільки поточний і попередній випуск up-to-date Apple-the-firm.

source: Last time we tested, some of the dependencies could not be installed on MacOSX 10.5 and we assume similar problems would present themselves on older OSX versions. Bauble has been successfully tested with 10.7 and 10.9.
es: La última vez que intentamos, no pudimos instalar las dependencias en MacOSX 10.5, seguramente los mismos problemas se encuentran con versiones anteriores. Bauble ha sido instalado exitosamente en la versión 10.9.
it: Durante l'ultima prova effettuata con MacOSX, non è stato possibile installare Bauble sulla 10.5, gli stessi problemi se non peggio si presenteranno di sicuro su versioni precedenti. Bauble è stato installato con successo su OSX 10.9.
uk: За останніми нашими тестуваннями, деякі з залежностей не можуть бути встановлені на MacOSX 10.5 і ми припускаємо, що подібні проблеми будуть і на більш старих версіях OSX. Bauble була успішно протестована з 10,7 і 10,9.

source: First of all, you need things which are an integral part of a unix environment, but which are missing in a off-the-shelf mac:
es: Primer paso, construir en MacOSX un entorno reconocible como unix:
it: Prima di tutto, è necessario completare quello che è un normale ambiente di sviluppo unix, che non è presente in un mac così come esce dal negozio.
uk: Перш за все, вам потрібно речі, які є невід'ємною частиною unix середовища, але які відсутні в off-the-shelf mac:

source: developers tools: xcode. check the wikipedia page for the version supported on your mac.
es: herramienta de desarrollo: xcode. por favor averigue en la wikipedia cual es la versión de xcode adapta a su mac.
it: attrezzi di sviluppo: xcode. verificare sulla wikipedia quale versione è adatta al mac in questione.
uk: інструменти розробника: xcode. перевірте сторінку Вікіпедії яка версія підтримується на mac.

source: package manager: homebrew (tigerbrew for older OSX versions).
es: gestor de paquetes: homebrew (o si utiliza un sistema más viejo, tigerbrew).
it: gestore di pacchetti: homebrew (su versioni più vecchie esiste tigerbrew).
uk: менеджер пакетів: homebrew (tigerbrew для старих версій OSX).

source: with the above installed, run::
es: siendo instalado lo de arriba, ejecutar::
it: avendo installato le precedenti, eseguire::
uk: з вище встановлено, запустити::

source: make sure you understand the problems it reports, and correct them. pygtk will need xquartz and brew will not solve the dependency automatically. either install xquartz using brew or the way you prefer::
es: asegúrese de haber entendido los problemas que serás reportados, y corríjalos. pygtk necesita xquartz y brew no puede solucionar la dependencia en manera automatica. use bre para instalar xquartz::
uk: переконайтеся, що ви розумієте виявлені проблеми, і виправте їх. pygtk знадобиться xquartz і brew не дозволить залежність автоматично. або встановіть xquartz, використовуючи brew або якщо ви вважаєте за краще::

source: then install the remaining dependencies::
es: y finalmente instalar las últimas dependencias::
it: ed ora istallare le ultime dipendenze::
uk: тоді встановіть решту залежностей::

source: follow all instructions on how to activate what you have installed.
es: siga las instrucciones relativas a como activar lo que acaba de instalar.
it: seguire le istruzioni su come attivare quanto installato.
uk: дотримуватися всіх інструкцій про те, як активувати то, що ви встановили.

source: the rest is just as on a normal unix machine, and we have a `devinstall.sh` script for it. Read the above Linux instructions, follow them, enjoy.
es: ahora puede seguir como en una normal máquina unix, y para eso tenemos un archivo de instalación. Lea las instrucciones para Linux, las siga, y disfrute.
it: il resto segue come su una normale macchina unix, puoi utilizzare lo stesso `devinstall.sh`. Leggi le istruzioni per Linux, seguile, buon utilizzo.
uk: інше так само, як на звичайній машині unix, і у нас є `devinstall.sh`скрипт для цього. Прочитайте вище інструкції Linux, слідуйте за ними, насолоджуйтесь.

source: Installing on Windows
es: Instalar en Windows
it: Installare su Windows
uk: Установка на Windows

source: The Windows installer used to be a "batteries-included" installer, installing everything needed to run Bauble. The current maintainer of bauble.classic cannot run Windows applications. If you want to run the latest version of bauble on Windows: download and install the dependencies and then install Bauble from the source package.
es: La última versión de Bauble con instalador específico para Windows es la 0.97. Ahora no distribuimos un instalador específico sino seguimos en Windows el mismo procedimiento como en Mac y Linux. Instale los paquetes necesarios para crear el entorno mínimo y luego conecte su instalación de Bauble al código fuente de la línea de producción.
uk: Інсталятор Windows використовується для "batteries-included" установки, встановлює все необхідне для запуску Bauble. Поточний супроводжуючий bauble.classic не може запускати додатки Windows. Якщо ви хочете, щоб запустити останню версію bauble на Windows: завантажте і встановіть залежність, а потім встановіть Bauble з вихідного пакета.

source: Please report any trouble and help with packaging will be very welcome.
es: Por favor reporte cualquier problema. Ayuda para preparar un paquete de instalación será muy apreciada.
uk: Повідомлення про виявлені проблеми і допомога з пакуванням дуже вітається.

source: Bauble has been tested with and is known to work on W-XP, W-7 and W-8. Although it should work fine on other versions Windows it has not been thoroughly tested.
es: Bauble ha sido comprobado con W-XP, W7 y W8. Muy probablemente funciona también con otras versiones de Windows.
it: Bauble è stato provato con successo su WXP, W7 e W8. Molto probabilmente funziona anche su altre versioni, ma non è stato provato.
uk: Bauble була протестована і як відомо, працює на W-XP, W-7 і W-8. Хоча і працює нормально на інших версіях Windows, Bauble не була ретельно протестована на них.

source: the installation steps on Windows:
es: los pasos de instalación en Windows:
it: i passi per l'installazione su Windows:
uk: кроки по установці на Windows:

source: download and install ``git`` (comes with a unix-like ``sh`` and includes ``vi``) from:
es: baje e instale ``git`` desde:
it: scaricare ad installare ``git`` (viene con un paio di cose buone come ``sh`` e ``vi``), prendendolo da:
uk: загрузити і встановити ``git`` (поставляється з unix-like ``sh`` і включає в себе ``vi``) з:

source: all default options are fine, except we need git to be executable from the command prompt:
es: todas opciones por defecto están bien, excepto que queremos poder encontrar git desde la línea de mando Windows:
it: quasi tutte le opzioni per difetto stanno bene: c'è bisogno di specificare che si vuol eseguire git dalla linea di comando Windows.
uk: всі опції за замовчуванням в порядку, за винятком git повинен бути виконуваним з командного рядка:

source: download and install Python 2.x (32bit) from:
es: baje e instale Python 2.7 (32 bit) desde:
it: scaricare ed installare
uk: завантажити та встановити Python 2.x (32bit) з:

source: Bauble has been developed and tested using Python 2.x. It will definitely **not** run on Python 3.x. If you are interested in helping port to Python 3.x, please contact the Bauble maintainers.
es: Bauble ha sido desarrollado utilizando Python 2.x. Las versiones Python que garantizamos son las 2.6 y 2.7. Bauble no funciona en Python 3.x.
uk: Bauble була розроблена і апробована з використанням Python 2.x. Це, безумовно, **не ** працюватиме на Python 3.x, будь ласка, зв'яжіться з розробниками Bauble.

source: when installing Python, do put Python in the PATH:
es: Cuando instala Python, ponga sus programas en el PATH:
it: durante l'installazione di Python, includere Python nel PATH:
uk: при установці Python, помістити Python в PATH:

source: download ``pygtk`` from the following source. (this requires 32bit python). be sure you download the "all in one" version::
es: baje e instale ``pygtk`` desde el repositorio siguiente (se requiere python 32bit). vamos a necesitar versión "all in one"::
it: scaricare ``pygtk`` dalla fonte seguente. (richiede python a 32bit). Fare attenzione a scaricare la versione "all in one"::
uk: завантажити ``pygtk`` з наступного джерела. (для цього потрібно 32-бітний python). переконайтеся, що ви завантажили "все в одному" версію::

source: make a complete install, selecting everything:
es: hágase una instalación completa, incluyéndolo absolutamente todo:
it: fare una installazione completa, includendo assolutamente tutto:
uk: зробити повну установку, вибравши все:

source: (optional) download and install a database connector other than ``sqlite3``.
es: (opcional) descargar e instalar un conector de base de datos además que ``sqlite3``.
it: (opzionale) scaricare ed installare connettori database al lato di ``sqlite3``, presente per difetto.
uk: (за бажанням), завантажити і встановити з'єднувач бази даних, окрім `` sqlite3``.

source: On Windows, it is NOT easy to install ``psycopg2`` from sources, using pip, so "avoid the gory details" and use a pre-compiled pagkage from:
es: En Windows no es nada fácil instalar ``psycopg2`` desde las fuentes. Por favor evítese complicaciones y utilice un paquete precompilado:
it: Su Windows, NON è facile installare ``psycopg2`` dai suoi sorgenti utilizzando pip, per piacere evitar problemi ed utilizzare un pacchetto precompilato da:
uk: У Windows не так легко встановити ``psycopg2`` з джерел, використайте pip, щоб "avoid the gory details" і скомпільованих пакет із:

source: **REBOOT**
es: **REINICIALICE**
it: **REINIZIALIZZARE**
uk: **ПЕРЕЗАВАНТАЖЕННЯ**

source: hey, this is Windows, you need to reboot for changes to take effect!
es: así es Windows, cambió cosas en el sistema, hay que reiniciar!
it: Giovani, questo è Windows, c'è bisogno di reinizializzare il sistema perché i cambiamenti abbiano effetto!
uk: Гей, це Windows, вам необхідно перезавантажити, щоб зміни вступили в силу!

source: download and run the batch file::
es: baje y ejecute el archivo batch::
it: scaricare ed eseguire il programmino batch::
uk: завантажте та запустіть пакетний файл::

source: this will pull the ``bauble.classic`` repository on github to your home directory, under ``Local\github\Bauble``, checkout the ``bauble-1.0`` production line, create a virtual environment and install bauble into it.
es: esto pone una copia del repositorio ``bauble.classic`` en su equipo, en la carpeta ``Local\github\Bauble``. conectada con la linea de producción 1.0, en seguida crea un entorno virtual en que finalmente instala bauble.
uk: це буде тягнути ``bauble.classic`` репозиторій на github в вашому домашньому каталозі, під ``Local\github\Bauble``, перевірте ``bauble-1.0`` виробничу лінію, створіть віртуальне середовище і встановіть bauble в нього.

source: you can also run ``devinstall.bat`` passing it as argument the numerical part of the production line you want to follow.
it: puoi anche eseguire ``devinstall.bat`` passandogli la parte numerica della linea di produzione che si vuol seguire.
uk: ви також можете запустити ``devinstall.bat`` передаючи в якості аргументу числову частину виробничої лінії якою ви хочете слідувати.

source: download the batch file you will use to stay up-to-date with the production line you chose to follow::
es: baje también el archivo para poner al día su instalación::
it: scaricare il programmino batch, per restare aggiornati con la linea di produzione scelta::
uk: завантажити пакетний файл, який буде використовуватися up-to-date виробничої лінії якій ви вирішили слідувати::

source: if you are on a recent Bauble installation, each time you start the program, Bauble will check on the development site and alert you of any newer bauble release within your chosen production line.
es: las versiones de Bauble después de la 1.0.40 averiguan, al arrancar, si hay una versión más recién en el repositorio central.
uk: Якщо у вас встановлена сучасна Bauble, то коли ви запускаєте програму, Bauble перевірятиме сайт розробника і попередить вас про випуск нових версій bauble в межах обраної виробничої лінії.
