Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/installing.po
Languages: es, it, uk

source: any time you want to update your installation, just start the command prompt and run ``bauble-update.bat``
es: cuando quiera poner al día su instalación, abra una ventana de terminal y ejecute ``bauble-update.bat``
it: in ogni momento che si voglia aggiornare l'installazione, basterà aprire la finestra con la linea di comando ed eseguire ``bauble-update.bat``
uk: в будь-який час ви можете оновити свою установку, просто відкрийте командний рядок і запустіть ``bauble-update.bat``

source: you can now start bauble using the ``bauble.lnk`` shortcut that the installation procedure copies to the ``Scripts`` directory of the virtual environment::
uk: Тепер ви можете запустити bauble за допомогою ``bauble.lnk`` ярлика, що процедура установки копіює в каталог ``Scripts`` віртуального середовища::

source: If you would like to generate and print PDF reports using Bauble's default report generator then you will need to download and install `Apache FOP <http://xmlgraphics.apache.org/fop/>`_. After extracting the FOP archive you will need to include the directory you extracted to in your PATH.
uk: Якщо ви хочете створювати і друкувати звіти в форматі PDF з використанням генератора звітів Bauble за замовчуванням, то вам необхідно буде завантажити і встановити `Apache FOP <http://xmlgraphics.apache.org/fop/>`_. Після розпакування архіву FOP вам потрібно буде включати каталог розпакування в свій PATH.

source: Troubleshooting the Install
it: Problemi durante l'installazione
uk: Пошук і усунення несправностей установки

source: What are the packages that are installed by Bauble:
uk: Пакети встановлені Bauble:

source: The following packages are required by Bauble
it: I seguenti pacchetti sono richiesti da Bauble
uk: Наступні пакети потрібні Bauble

source: The following packages are optional:
it: I seguienti pacchetti sono opzionali:
uk: Наступні пакети не є обов'язковими:

source: Mako - required by the template based report generator
uk: Mako - потрібно генератор звітів на основі шаблону

source: gdata - required by the Picasa photos InfoBox
uk: gdata - потрібно Picasa фотографії InfoBox

source: Couldn't install lxml.
uk: Не вдалося встановити lxml.

source: The lxml packages have to be compile with a C compiler. If you don't have a Make sure the libxml and libxsl packages are installed. Installing the Cython packages. On Linux you will have to install the gcc package. On Windows there should be a precompiled version available at http://pypi.python.org/pypi/lxml/2.1.1
uk: Пакети lxml повинні компілюватись з С компілятором. Якщо у вас немає переконайтеся, що встановлені libxml і libxsl пакети. Установіть пакети Cython. У Linux вам доведеться встановити gcc пакет. У Windows повинна бути прекомпілірована версія доступна на http://pypi.python.org/pypi/lxml/2.1.1

source: Couldn't install gdata.
uk: Не вдалося встановити gdata.

source: For some reason the Google's gdata package lists itself in the Python Package Index but doesn't work properly with the easy_install command. You can download the latest gdata package from:
uk: З якоїсь причини пакет gdata від Google перераховує себе в Python Package Index, але не працює належним чином з командою easy_install. Завантажте останній пакет gdata від:

source: Unzip it and run ``python setup.py installw`` in the folder you unzip it to.
uk: Розпакуйте його і запустіть ``python setup.py installw`` в папці розпакування.

source: Direct download links are given for all needed components. They have been tested in September 2015, but things change with time. If any of the direct download links stops working, please ring the bell, so we can update the information here.
uk: Наведені прямі посилання для завантаження для всіх необхідних компонентів. Вони були випробувані в вересні 2015 року, але все змінюється з часом. Якщо яка-небудь з ланок прямого завантаження перестає працювати, будь ласка, зателефонуйте, що б ми могли оновити інформацію.

source: `Direct link to download git`_
uk: `Пряме посилання на завантаження git`_

source: `Direct link to download Python`_
uk: `Пряме посилання на завантаження Python`_

source: `Direct link to download PyGTK`_
uk: `Пряме посилання на завантаження PyGTK`_

source: `Direct link to download psycopg2`_
uk: `Пряме посилання на завантаження psycopg2`_
