Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/peptalk.po
Languages: es

source: not-so-brief list of highlights, meant to whet your appetite.
es: cositas buenas que se encuentran en Bauble.

source: taxonomic information
es: información taxonómica

source: When you first start Bauble, and connect to a database, Bauble will initialize the database not only with all tables it needs to run, but it will also populate the taxon tables for ranks family and genus, using the data from the “RBG Kew's Family and Genera list from Vascular Plant Families and Genera compiled by R. K. Brummitt and published by the Royal Botanic Gardens, Kew in 1992”. In 2015 we have reviewed the data regarding the Orchidaceae, using “Tropicos, botanical information system at the Missouri Botanical Garden - www.tropicos.org” as a source.
es: Al arrancar por primera vez Bauble, y al conectarse a una base de datos, Bauble inicialisa la base de datos no solo con las tablas necesarias para correr Bauble, sino llena las tablas de los taxones para los rangos familia y género, utilizando la información de “RBG Kew's Family and Genera list from Vascular Plant Families and Genera” compilada por R. K. Brummitt y publicada por el Royal Botanic Gardens, Kew, en el año 1992. En el 2015 hemos revisado la familia Orchidaceae, utilizando como fuente de información “Tropicos, botanical information system at the Missouri Botanical Garden - www.tropicos.org”.

source: importing data
es: importar datos

source: Bauble will let you import any data you put in an intermediate json format. What you import will complete what you already have in the database. If you need help, you can ask some Bauble professional to help you transform your data into Bauble's intermediate json format.
es: Bauble le permite importar datos que se encuentren en un formato json intermedio, pensado para intercambio entre versiones de Bauble. Los datos importados se combinan a completar lo que ya se encuentra en la base de datos. Si cree, puede pedir ayuda a un profesional de Bauble para poner en el formato json intermedio de intercambio toda la información que esté en su base de datos actual, para importarla en Bauble.

source: synonyms
es: sinónimos

source: Bauble will allow you define synonyms for species, genera, families. Also this information can be represented in its intermediate json format and be imported in an existing Bauble database.
es: Bauble le permite definir sinónimos para especies, géneros, familias. También esta información puede ser representada en el formato json de intercambio y puede ser importada in una base de datos Bauble.

source: scientific responsible
es: científicamente responsable

source: Bauble implements the concept of 'accession', intermediate between physical plant (or a group thereof) and abstract taxon. Each accession can associate the same plants to different taxa, if two taxonomists do not agree on the identification: each taxonomist can have their say and do not need overwrite each other's work. All verifications can be found back in the database, with timestamp and signature.
es: Bauble implementa el concepto de “accesión”, conexión abstracta entre la planta física (o un grupo de plantas) y la especie o taxón a que pertenecen. Cada accesión puede asociar todo el mismo grupo de plantas que le pertenece a uno o más taxones, en el caso no haya acuerdo entre los taxónomos a disposición del jardín: cada taxónomo puede insertar su opinión en la base de datos, sin necesitar borrar la información anteriormente presente. Todas las verificaciones se encuentran en la base de datos, con fecha y firma.

source: helps off-line identification
es: ayuda a la identificación

source: Bauble allows you associate pictures to physical plants, this can help recognize the plant in case a sticker is lost, or help taxonomic identification if a taxonomist is not available at all times.
es: Bauble le permite asociar fotos a plantas físicas, esto puede ayudarle a reconocer la planta en caso de que se pierda la nota, o ayudar a la identificación taxonómica si no está disponible un taxónomo.

source: exports and reports
es: exportar e informar

source: Bauble will let you export a report in whatever textual format you need. It uses a powerful templating engine named 'mako', which will allow you export the data in a selection to whatever format you need. Once installed, a couple of examples are available in the mako subdirectory.
es: Bauble le permite exportar los datos en cualquier formato textual le parezca útil. Bauble utiliza un motor de plantillas muy flexible, que se llama “mako”, con el cual solo su imaginación es el límite a los formatos en que exportar los datos. Una vez instalado, hay varios ejemplos en la carpeta `mako`.

source: annotate your info
es: anotar la información

source: You can associate notes to plants, accessions, species, .... Notes can be categorized and used in searches or reports.
es: A practicamente todos objectos en la base de datos es posible asociar notas. Las notas se pueden categorizar y por supuesto utilizar en búsquedas.

source: garden or herbarium
es: jardín o herbario

source: Management of plant locations.
es: manejo de ubicaciones de plantas.

source: database history
es: historia en la base de datos

source: All changes in the database is stored in the database, as history log. All changes are 'signed' and time-stamped. Bauble makes it easy to retrieve the list of all changes in the last working day or week, or in any specific period in the past.
es: Todos los cambios en la base de datos se almacenan en un log. Todos los cambios son 'firmados' y sellados temporalmente. Bauble hace fácil la recuperación de todos los cambio en el último día o semana, o en un período especifico del pasado.

source: simple and powerful search
es: búsquedas sencillas y expresivas

source: Bauble allows you search the database using simple keywords, e.g.: the name of the location or a genus name, or you can write more complex queries, which do not reach the complexity of SQL but allow you a decent level of detail localizing your data.
es: Bauble le permite consultar la base de datos empleando palabras clave sencillas, p.e.: el nombre del lugar o un nombre de género, o puede escribir consultas más complejas, que no llegarán a la complejidad de SQL paro que le permitirán localizar sus datos con un nivel de detalle aceptable.

source: database agnostic
es: independiente del sistema di gestión de base de datos

source: Bauble is not a database management system, so it does not reinvent the wheel. It works storing its data in a SQL database, and it will connect to any database management system which accepts a SQLAlchemy connector. This means any reasonably modern database system and includes MySQL, PostgreSQL, Oracle. It can also work with sqlite, which, for single user purposes is quite sufficient and efficient. If you connect Bauble to a real database system, you can consider making the database part of a LAMP system (Linux-Apache-MySQL-Php) and include your live data on your institution web site.
es: Bauble no es un sistema de gestión de base de datos, ni intenta serlo. Bauble guarda la colección en una base de datos SQL, y se puede conectar a virtualmente cualquier sistema SQL para que exista un conector SQLAlchemy. En práctica esto incluye todos los más modernos sistemas relacionales, como MySQL, PostgreSQL, Oracle. También puede trabajar con SQLite, que, para usuarios independientes es un sistema muy eficiente y por supuesto más que suficiente. En combinación con un sistema de gestión SQL, es posible construir un sistema LAMP (Linux-Apache-MySQL-Php) o similar, e incluir la colección actualizada en el sitio web de su institución.

source: language agnostic
es: internacionalista

source: The program was born in English and all its technical and user documentation is still only in that language, but the program itself has been translated and can be used in various other languages, including Spanish (86%), Portuguese (100%), French (42%), to name some Southern American languages, as well as Swedish (100%) and Czech (100%).
es: El programa Bauble tuvo origen en Ingles y toda su documentación nace en ese idioma. Sin embargo, tanto el programa cuanto la documentación utilizan `gettext`, la tecnología más avanzada y difundida para la traducción del software y de la documentación. Al momento de escribir, la traducción del programa al castellano está al 86%, la documentación algo menos que el 20%.

source: platform agnostic
es: independiente de la plataforma

source: Installing Bauble on Windows is an easy and linear process, it will not take longer than 10 minutes. Bauble was born on Linux and installing it on ubuntu, fedora or debian is also rather simple. It has been recently successfully tested on MacOSX 10.9.
es: Instalar Bauble en Windows es un proceso linear y sencillo, no tomará más tiempo que unos 10 minutos. Bauble nación en Linux y su instalación en ubunto, fedora o debian es igualmente muy sencilla. Recién ha sido posible instalarlo en un Mac con OSX10.9.

source: easily updated
es: fácil puesta al día

source: The installation process will produce an updatable installation, where updating it will take less than one minute. Depending on the amount of feedback we receive, we will produce updates every few days or once in a while.
es: El proceso de instalación produce una instalación que, si deseado, se puede poner al día en menos que un minuto. Dependiendo de la cantidad de respuesta recibida, quien trabaja en Bauble produce una nueva distribución cada par de días o de vez en cuando.

source: unit tested
es: pruebas unitarias

source: Bauble is continuously and extensively unit tested, something that makes regression of functionality close to impossible. Every update is automatically quality checked, on the Travis Continuous Integration service. Integration of TravisCI with the github platform will make it difficult for us to release anything which has a single failing unit test.
es: Bauble es continuamente y extensamente controlado con pruebas unitarias, algo que hace casi imposible introducir errores en el código. Cada puesta al día es automaticamente verificada por el servicio Travis Continuous Integration. La buena integración de las plataformas Travis-ci y github hace muy complicado distribuir en github algo para que travis-ci haya evidenciado un error.

source: Most changes and additions we make, come with some extra unit test, which defines the behaviour and will make any undesired change easily visible.
es: Virtualmente cada cambio y extención que se hace en Bauble, va acompañada por unas nuevas pruebas unitarias, que define el comportamiento y evidenciará en el futuro cada cambio no deseado.

source: customizable/extensible
es: adaptable/extensible

source: Bauble is extensible through plugins and can be customized to suit the needs of the institution.
es: Bauble puede ser expandido a través de complementos (plugin), y puede ser adaptado según lo que necesite la institución que lo adopte.
