Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/report.po
Languages: uk

source: Generating reports
uk: Створення звітів

source: Using the Mako Report Formatter
uk: Використання форматера звіту Mako

source: The Mako report formatter uses the Mako template language for generating reports. More information about Mako and its language can be found at `makotemplates.org <http://www.makotemplates.org>`_.
uk: Форматер звіту Mako використовує мову шаблонів Mako для генерації звітів. Більш детальну інформацію про Мако і його мову можна знайти на сайті `makotemplates.org <http://www.makotemplates.org>`_.

source: The Mako templating system should already be installed on your computer if Bauble is installed.
uk: Система шаблонів Mako вже повинна бути встановлена на вашому комп'ютері, якщо встановлено Bauble.

source: Creating reports with Mako is similar in the way that you would create a web page from a template. It is much simpler than the XSL Formatter(see below) and should be relatively easy to create template for anyone with a little but of programming experience.
uk: Створення звітів за допомогою Мако аналогічна тому, як ви можете створити веб-сторінку за допомогою шаблону. Це набагато простіше, ніж XSL Formatter (див нижче) і відносно легко буде створити шаблон для тих, хто хоча б з невеликим досвідом програмування.

source: The template generator will use the same file extension as the template which should indicate the type of output the template with create. For example, to generate an HTML page from your template you should name the template something like `report.html`. If the template will generate a comma seperated value file you should name the template `report.csv`.
uk: Генератор шаблонів буде використовувати таке ж розширення файлу як шаблон, який повинен вказати тип вихідного шаблону створення.

source: The template will receive a variable called `values` which will contain the list of values in the current search.
uk: Шаблон буде отримувати змінну `values`, яка буде містити список значень в поточному пошуку.

source: The type of each value in `values` will be the same as the search domain used in the search query. For more information on search domains see :ref:`search-domains`.
uk: Тип кожного значення в `values` буде таким же, як область пошуку, що використовується в пошуковому запиті. Для отримання додаткової інформації про пошукові домени дивитися: :ref:`search-domains`.

source: If the query does not have a search domain then the values could all be of a different type and the Mako template should prepared to handle them.
uk: Якщо запит не має пошукового домену, то всі значення можуть бути різного типу і шаблон Мако повинен бути готовий впоратися з ними.

source: Using the XSL Report Formatter
uk: Використання XSL Report Formatter

source: The XSL report formatter requires an XSL to PDF renderer to convert the data to a PDF file. Apache FOP is is a free and open-source XSL->PDF renderer and is recommended.
uk: XSL форматер звітів вимагає представляти XSL в PDF для перетворення даних в PDF файл. Apache FOP є безкоштовним і з відкритим вихідним кодом XSL->PDF визуализатор що рекомендується.

source: If using Linux, Apache FOP should be installable using your package manager. On Debian/Ubuntu it is installable as ``fop`` in Synaptic or using the following command::
uk: При використанні Linux, Apache FOP повинен бути встановлений за допомогою менеджера пакетів. В Debian/Ubuntu це встановлювана як ``fop`` в Synaptic або за допомогою наступної команди ::

source: Installing Apache FOP on Windows
uk: Установка Apache FOP на Windows

source: You have two options for installing FOP on Windows. The easiest way is to download the prebuilt `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges>`_ installer.
uk: У вас є два варіанти установки FOP на Windows. Найпростіший спосіб це завантажити скомпільований `ApacheFOP-0.95-1-setup.exe <http://code.google.com/p/apache-fop-installer/downloads/detail?name=ApacheFOP-0.95-1-setup.exe&can=2&q=#makechanges>`_ installer.

source: Alternatively you can download the `archive <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. After extracting the archive you must add the directory you extracted the archive to to your PATH environment variable.
uk: В якості альтернативи ви можете скачати `archive <http://www.apache.org/dist/xmlgraphics/fop/binaries/>`_. Після вилучення архіву ви повинні додати каталог, розпакував архів в змінну PATH середовища.
