Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/searching.po
Languages: uk

source: Searching in Bauble
uk: Пошук в Bauble

source: Searching allows you to view, browse and create reports from your data. You can perform searches by either entering the queries in the main search entry or by using the Query Builder to create the queries for you. The results of Bauble searches are listed in the main window.
uk: Пошук дозволяє представляти, перегляд і створювати звіти з ваших даних. Ви можете виконувати пошук ввівши запит в основному компоненті пошуку або використати Query Builder для створення запитів. Результати пошуку Bauble виводяться в головному вікні.

source: Search Strategies
uk: Стратегії пошуку

source: Three are three types of search strategies available in Bauble. Considering the search stragety types available in Bauble, sorted in increasing complexity: you can search by value, expression or query.
uk: Три з трьох стратегій пошуку доступні в Bauble. Взагалі типи стратегій пошуку доступних в Bauble, сортуються за зростанням складності: ви можете здійснювати пошук за значенням, виразом або запитом.

source: Searching by query, the most complex and powerful, is assisted by the Query Builder, described below.
uk: Пошук за запитом, найскладніший і потужний, за допомогою Query Builder, як описано нижче.

source: All searches are case insensitive so searching for Maxillaria and maxillaria will return the same results.
uk: Всі пошуки нечутливі до реєстру, тому пошук Maxillaria і maxillaria поверне однакові результати.

source: Search by Value
uk: Пошук за значенням

source: Search by value is the simplest way to search. You just type in a string and see what matches. Which fields/columns are search for your string depends on how the different plugins are configured. For example, by default the PlantPlugin search the family name, the genus name, the species and infraspecific species names, vernacular names and geography. So if you want to search in the notes field of any of these types then searching by value is not the search you're looking for.
uk: Пошук за значенням є найпростішим способом пошуку. Просто наберіть в рядку і подивіться відповідь. Які поля/стовпці пошуку для вашого рядка залежить від налаштувань плагінів. Наприклад, за замовчуванням PlantPlugin шукає прізвища, родові назви, види і внутрішньовидові назви видів, просторічні назви і географію. Так що якщо ви хочете шукати в полі примітки любий з цих типів то пошук за значенням це не пошук, що вам потрібний.

source: Examples of searching by value would be: Maxillaria, Acanth, 2008.1234, 2003.2.1
uk: Приклади пошуку за значенням: Maxillaria, Acanth, 2008.1234, 2003.2.1

source: Search string are separated by spaces. For example if you enter the search string ``Block 10`` then Bauble will search for the strings Block and 10 and return all the results that match either of these strings. If you want to search for Block 10 as a while string then you should quote the string like ``"Block 10"``.
uk: Рядок пошуку розділений пробілами. Наприклад, якщо ввести в рядок пошуку ``Block 10`` то Bauble буде шукати рядки Block і 10 та поверне всі результати, які відповідають цим рядкам. Якщо ви хочете знайти безроздільно Block 10 у рядку, то ви повинні ввести в рядок пошуку, як цитату ``"Block 10"``.

source: Search by Expression
uk: Пошук за виразом

source: Searching with expression gives you a little more control over what you are searching for. It can narrow the search down to a specific domain. Expression consist of a domain, an operator and a value. For example the search: ``gen=Maxillaria`` would return all the genera that match the name Maxillaria. In this case the domain is gen, the operator is = and the value is Maxillaria.
uk: Пошук за виразом дає вам трохи більше контролю над тим, що ви шукаєте. Це може звузити область пошуку до певного домену. Вираз складається з домену, оператора і значення. Наприклад, пошук: ``gen=Maxillaria`` буде повертати всі роди, які відповідають імені Maxillaria. В цьому випадку домен є gen, оператор є = і значення є Maxillaria.

source: The search string ``gen like max%`` would return all the genera whose names start with "Max". In this case the domain again is gen, the operator is like, which allows for "fuzzy" searching and the value is max%. The percent sign is used as a wild card so if you search for max% then it search for all value that start with max. If you search for %max it searches for all values that end in max. The string %max%a would search for all value that contain max and end in a.
uk: Рядок пошуку ``gen like max%`` буде повертати всі роди, чиї імена починаються з "Max". В цьому випадку доменом знову є gen, оператором є like, що дозволяє "вибірковий" пошук і значенням є max%. Знак відсотка використовується в якості джокера, так якщо ви шукаєте max% то шукаються всі значення, які починаються з max. Якщо ви шукаєте %max шукаються всі значення, які закінчуються на max. Рядок %max% шукатиме всі значення, які містять max і в кінці а.

source: For more information about the different search domain and their short-hand aliases, see search-domains_ .
uk: Для отримання додаткової інформації про інші домени пошуку і їх стенографічні псевдонімами, дивіться search-domains_ .

source: If expression are invalid they are usually used as search by value searchs. For example the search string ``gen=`` will execute a search by value for the string gen and the search string ``gen like`` will search for the string gen and the string like.
uk: Якщо вираз недійсний він, як правило, використовується в якості пошуку значень пошуку. Наприклад, пошук рядка ``gen=`` буде виконувати пошук за значенням для рядка gen а рядок пошуку ``gen like`` буде шукати рядок gen і рядок like.

source: Search by Query
uk: Пошук по запиту

source: Queries allow the most control over searching. With queries you can search across relations, specific columns and join search using boolean operators like AND and OR.
uk: Запити дозволяють найбільший контроль над пошуком. З запитами ви можете здійснювати пошук по відносинам, конкретним стовпцям і об'єднати пошук з використанням логічних операторів, таких як AND і OR.

source: An example of a query would be::
uk: Приклад запиту буде::

source: This query would return all the plants whose family are Fabaceae and are located in Block 10.
uk: Цей запит буде повертати всі рослини, чия сім'я Fabaceae і розташованих в Block 10.

source: Searching with queries usually requires some knowledge of the Bauble internals and database table layouts.
uk: Пошук за допомогою запитів, як правило, вимагає знання організації Bauble і макетів таблиць бази даних.

source: A couple of useful examples:
uk: Кілька корисних прикладів:

source: Which locations are in use::
uk: Які місця в використанні::

source: Which genera are associated to at least one accession::
uk: Які роди пов'язані для щонайменше, одного приєднання::

source: Domains
uk: Домени

source: The following are the common search domain and the columns they search by default. The default columns are used when searching by value and expression. The queries do not use the default columns.
uk: Нижче наведено загальний домен пошуку і стовпів, вони здійснюють пошук за замовчуванням.

source: The Query Builder
uk: Query Builder

source: The Query Builder helps you build complex search queries through a point and click interface. To open the Query Builder click the to the left of the search entry or select :menuselection:`Tools-->Query Builder` from the menu.
uk: Query Builder дозволяє будувати складні пошукові запити через вказування і натискання в інтерфейсі. Для того, щоб відкрити Query Builder натисніть зліва від входу пошуку або виберіть :menuselection:`Tools-->Query Builder` в меню.

source: The Query Builder composes a query that will be understood by the Query Search Strategy described above. You can use the Query Builder to get a feeling of correct queries before you start typing them by hand, something that you might prefer if you are a fast typer.
uk: Query Builder компонує запит, який буде зрозумілий стратегії пошукового запиту, описаної вище. Ви можете використовувати Query Builder щоб отримати відчуття правильних запитів, перш ніж почати вводити їх вручну, щось чому ви напевно-що надаєте перевагу, якщо ви скоро друкуєте.

source: After opening the Query Builder you must select a search domain. The search domain will determine the type of data that is returned and the properties that you can search.
uk: Після відкриття Query Builder необхідно вибрати домен пошуку. Домен пошуку буде визначити тип даних, що повертаються і властивості, які ви можете шукати.

source: The search domain is similar to a table in the database and the properties would be the columns on the table. Often the table/domain and properties/columns are the same but not always.
uk: Домен пошуку схожий на таблицю в базі даних і властивості стовпців в таблиці. Часто таблиця/домен і властивості/стовпці однакові, але не завжди.

source: Once a search domain is selected you can then select a property of the domain to compare values to. The search operator can then be changed for how you want to make the search comparison. Finally you must enter a value to compare to the search property.
uk: Після обрання домену пошуку ви можете вибрати властивість домену для порівняння значень. Оператор пошуку може бути змінений, як ви хочете, щоб зробити порівняння пошуку. Нарешті, ви повинні ввести значення для порівняння з властивостями пошуку.

source: If the search property you have selected can only have specific values then a list of possible values will be provided for you to choose from.
uk: Якщо ви вибрали властивість пошуку то це може мати тільки певні значення, список можливих значень буде надано для вас для вибору.

source: If multiple search properties are necessary then clicking on the plus sign will add more search properties. Select And/Or next to the property name choose how the properties will be combined in the search query.
uk: Якщо необхідно кілька властивостей пошуку, натисніть на знак плюс що додасть більше властивостей пошуку. Виберіть And/Or поруч з ім'ям вибраних властивостей, для визначення, як властивості будуть об'єднані в пошуковому запиті.

source: When you are done building your query click OK to perform the search.
uk: Коли ви закінчите створення свого запиту натисніть кнопку OK, щоб виконати пошук.
