Repository: Bauble/bauble.classic-docs.i18n
Catalog: locale/*/LC_MESSAGES/started.po
Languages: uk

source: Getting Started
uk: Починаємо

source: Should you SQLite?
uk: У вас SQLite?

source: Is this the first time you use Bauble, are you going to work in a stand-alone setting, you have not the faintest idea how to manage a database management system? If you answered yes to any of the previous, you probably better stick with SQLite, the easy, fast, zero-administration file-based database.
uk: Це перший раз, коли ви використовуєте Bauble, ви збираєтеся працювати в автономному режимі, ви не маєте жодного уявлення про те, як управляти системою управління базами даних? Якщо ви відповіли ствердно на будь-який з перелічених запитань, вам напевно краще триматися з SQLite, легкої, швидкої, нульової адміністрації на основі файлу бази даних.

source: With SQLite, you do not need any preparation and you can continue with `connecting`_.
uk: З SQLite, вам не потрібно ніякої підготовки, і ви можете продовжити `connecting`_.

source: On the other hand, if you want to connect more than one bauble workstation to the same database, or if you want to make your data available for other clients, as could be a web server in a LAMP setting, you should consider keeping your database in a database management system like `PostgreSQL <http://www.postgresql.org>`_ or `MySQL/MariaDB <https://mariadb.org/>`_, both supported by Bauble.
uk: З іншого боку, якщо ви хочете підключити більше однієї bauble робочої станції в одній і тій же базі даних, або якщо ви хочете, щоб ваші дані були доступними для інших клієнтів, як в налаштуванні LAMP веб сервера, ви повинні забезпечити зберігання бази даних в системі управління базами даних, як `PostgreSQL <http://www.postgresql.org>`_ або `MySQL/MariaDB <https://mariadb.org/>`_, обидва варіанти підтримуються Bauble.

source: When connecting to a database server as one of the above, you have to manually create: at least one bauble user, the database you want bauble to use, and to give at lest one bauble user full permissions on its database. When this is done, Bauble will be able to proceed, creating the tables and importing the default data set. The process is database-dependent and it falls beyond the scope of this manual.
uk: При підключенні до сервера бази даних в якості одного з вище вказаного, ви повинні створити вручну: щонайменше одного користувача bauble, базу даних яку ви хочете використовувати, і надати повні права користувачеві bauble на цю базу даних. Коли це буде зроблено, Bauble матиме можливість продовжити, створення таблиць та імпорт набору даних за замовчуванням. Процес бази даних - залежить і виходить за рамки даного керівництва.

source: If you already got the chills or sick at your stomach, no need to worry, just stick with SQLite, you do not miss on features nor performance.
uk: Якщо у вас вже є озноб або біль в животі, немає необхідності турбуватися, просто тримайтеся SQLite, ви не зазнаєте невдачі на особливостях, ні в продуктивності.

source: Connecting to a database
uk: Підключення до бази даних

source: When you start Bauble the first thing that comes up is the connection dialog.
uk: При запуску Bauble вперше спливає діалогове вікно підключення.

source: Quite obviously, if this is the first time you start Bauble, you have no connections yet and Bauble will alert you about it.
uk: Цілком очевидно, що, якщо це перший раз, коли ви запускаєте Bauble, у вас немає ще підключення і Bauble попередить вас про це.

source: As it says: close the message box, you will return to the connection dialog, where you click on **Add** to create your first connection.
uk: Як повідомлялося: закрийте вікно повідомлення і ви повернетеся в діалогове вікно підключення, де натисніть на **Додати** щоб створити перше з'єднання.

source: Just insert a name for your connection, something meaningful you associate with the collection to be represented in the database (for example: “my home garden”), and click on **OK**. You will be back to the previous screen, but your connection name will be selected and the Connection Details will have expanded.
uk: Просто вставте ім'я для підключення, щось значуще що ви асоціюєте з колекцією для представлення в базі даних (наприклад: «мій домашній сад») і натисніть **OK**. Ви повернетеся до попереднього екрана, але ваше ім'я з'єднання буде обрано і Деталі Підключення будуть розширені.

source: **specify the connection details**
uk: **вказати параметри з'єднання**

source: If you do not know what to do here, Bauble will help you stay safe. Activate the **Use default locations** check box and create your first connection by clicking on **Connect**.
uk: Якщо ви не знаєте, що робити тут, Bauble допоможе вам залишатися в безпеці. Активуйте **Використання розташування за замовчуванням** шляхом встановлення прапорця і створіть перше з'єднання, натиснувши на **Підключення**.

source: You may safely skip the remainder of this section for the time being and continue reading to the following section.
uk: На даний момент ви можете сміливо пропустити решту цього розділу і продовжити читати наступний розділ.

source: **fine-tune the connection details**
uk: **точно налаштувати деталі з'єднання**

source: By default Bauble uses the file-based SQLite database. During the installation process you had the choice (and you still have after installation), to add database connectors other than the default SQLite.
uk: За замовчуванням Bauble використовує файл бази даних на основі SQLite. В процесі установки у вас був вибір (і він у вас залишається і після установки), додати інші, ніж SQLite за замовчуванням з'єднувачі бази даних.

source: In this example, Bauble can connect to SQLite, PostgreSQL and MySQL, but no connector is available for Oracle or MS SQL Server.
uk: У цьому прикладі, Bauble може підключитися до SQLite, PostgreSQL і MySQL, але немає з'єднувачів доступних для Oracle або MS SQL Server.

source: If you use SQLite, all you really need specify is the connection name. If you let Bauble use the default filename then Bauble creates a database file with the same name as the connection and ``.db`` extension, and a pictures folder with the same name and no extension, both in ``~/.bauble`` on Linux/MacOSX or in ``AppData\Roaming\Bauble`` on Windows.
uk: Якщо ви використовуєте SQLite, все, що вам дійсно потрібно це вказати ім'я з'єднання. Якщо ви дозволите Bauble використовувати ім'я файлу за замовчуванням, то Bauble створює файл бази даних з тим же ім'ям, що і з'єднання і ``.db`` розширення, і папку зображень з таким же ім'ям і без розширення, як в ``~/.bauble``в Linux/MacOSX або в ``AppData\Roaming\Bauble`` в Windows.

source: Still with SQLite, you might have received or downloaded a bauble database, and you want to connect to it. In this case you do not let Bauble use the default filename, but you browse in your computer to the location where you saved the Bauble SQLite database file.
uk: Проте з SQLite, ви, можливо, отримали або завантажили bauble базу даних, і ви хочете підключитися до неї. В цьому випадку ви не дозволяєте Bauble використовувати ім'я файлу за замовчуванням, лише перегляньте на комп'ютері в тому місці, де ви зберегли Bauble SQLite файл бази даних.

source: If you use a different database connector, the dialog box will look different and it will offer you the option to fine tune all parameters needed to connect to the database of your choice.
uk: Якщо ви використовуєте інше з'єднання бази даних, діалогове вікно буде виглядати по-іншому і вам запропонують варіант для точної настройки всіх параметрів необхідних для підключення до бази даних за вашим вибором.

source: If you are connecting to an existing database you can continue to :ref:`editing-and-inserting-data` and subsequently :ref:`searching-in-bauble`, otherwise read on to the following section on initializing a database for Bauble.
uk: При підключенні до існуючої бази даних ви можете продовжувати :ref:`editing-and-inserting-data` і згодом :ref:`searching-in-bauble`, в іншому випадку читайте далі в наступному розділі про ініціалізацію бази даних для Bauble.

source: If you plan to associate pictures to plants, specify also the *pictures root* folder. The meaning of this is explained in further detail at :ref:`plant-pictures` in :ref:`editing-and-inserting-data`.
uk: Якщо ви плануєте пов'язати фотографії з установкою, вкажіть *pictures root* папку. Сенс цього пояснено більш детально в :ref:`editing-and-inserting-data`.

source: Initialize a database
uk: Ініціалізувати базу даних

source: First time you open a connection to a database which had never been seen by Bauble before, Bauble will first display an alert:
uk: Коли ви відкриваєте з'єднання з базою даних, яка не відмічена в Bauble перший раз, Bauble спочатку відобразить оповіщення:

source: immediately followed by a question:
uk: відразу слідує запитання:

source: Be careful when manually specifying the connection parameters: the values you have entered may refer to an existing database, not intended for use with Bauble. By letting Bauble initialize a database, the database will be emptied and all of its content be lost.
uk: Будьте обережні, коли вручну, вказуєте параметри з'єднання: значення, які ви ввели і відсилатися до існуючої бази даних, можуть бути не призначені для використання в Bauble.

source: If you are sure you want to create a database at this connection then select "Yes". Bauble will then start creating the database tables and importing the default data. This can take a minute or two so while all of the default data is imported into the database so be patient.
uk: Якщо ви впевнені, що ви хочете створити базу даних з цим підключенням виберіть "Так". Bauble приступить до створення таблиць бази даних та імпорту даних за замовчуванням.

source: Once your database has been created, configured, initialized, you are ready to start :ref:`editing-and-inserting-data` and subsequently :ref:`searching-in-bauble`.
uk: Після того, як база даних була створена, налаштована,ініціалізована, ви готові до запуску :ref:`editing-and-inserting-data` і згодом :ref:`searching-in-bauble`.
